{"id": "_cs.61038", "question": "I am trying to classify the data in a database columns. DB has about 90 million entries.The main goal is to find different patterns in columns to leverage it for create look alike data. The data columns has entries which can easily look like patterns as : CUST1212,CUST1213,CUST1214...,  number sequential after CUST CODE1213,CODE1242,CODE1289...   random numbers after code CUST1213,MUST8324,FIFA12313...   009-123-2123,003-124-2314,006-213-5322, INTER122,INTER222,INTER322...,  number increasing in batch of 100 OM|ON|TO, IO|OI|UH...,  pipe delimited  some 6 and 7 digits number.The issue is there are so many patterns and looks like creating patterns manually based on data is out of option.I would really appreciate if one can point to how can I build a collection of patterns preferably by usage frequency.What I started is 1. Segregate the data as per their length as patterns usually generate same string length, sorted them and stored them in different files. 2. Then classifying them further as per Alphabet prefix or numeric prefix. 3. For alpha-prefix segregate further on common alphabets at start.Now seems I am lost and sincerely hoping if one can point out to me what are my options and probably best to took.I believe if end of computation if get something like patterns in data and their frequency e.g. CUST[0-9]{4} -> 10k times, [a-zA-Z]{4} -> 50k times [0-9]{3}-[0-9]{3}-[0-9]{4} 10K times etc....., it would be great.Thanks", "title": "Find string patterns preferably in regex for string streams", "tags": "regular expressions;data mining;classification;pattern recognition"}
{"id": "_webmaster.15113", "question": "I'm redesigning a website. For certain content areas the layout is fine at my text size but screws up if I set the text any bigger. I often resize pages with Firefox, but the whole page resizes so the layout still works. So, should I worry about users having larger text but the same CSS otherwise? I don't know how to test for this sort of thing. The site works fine with every browser I've looked at it with. I know some usability devices change layouts but don't they ignore normal styles altogether?", "title": "Do users resize text?", "tags": "usability", "accepted_answer": "it really depends on the target audience i'd say. if its a frontfacing website i think you should cover your bets and try and make it look good (or atleast usable) with increased text size, if its an internal website perhaps it doesnt matter so much..sorry for the vague awnser, but its really something the customer (internal or external) can awnser best "}
{"id": "_webapps.1318", "question": "Is there a web service that can receive faxes and store them in a PDF format? I would like to be able to keep my current fax number.", "title": "Is there a web service that can receive faxes and store them in a PDF format?", "tags": "webapp rec;storage;pdf;fax", "accepted_answer": "The answer given to this question can help you here.efax.com offers a service to keep your existing number. You have to ring to discuss it. The number I see is a UK one - I'm guessing because the site detects your locale and offers a local service - so I won't post it here as it won't apply to everyone."}
{"id": "_codereview.27144", "question": "I'm having trouble structuring the logic of OAuth integration into my web app. In the app, a user creates a Report that consists of data from their Google Analytics account.User steps:User clicks 'New Report'Google presents the 'Allow Access' page for OAuth accessUser is presented with a list of their GA web properties and selects oneA report is created using data from the selected web propertyMy issue is in structuring the code below.When the user clicks New Report, they are actually redirected to google_analytics#ga_session to begin the authorization process. The code to retrieve the user's web properties succeeds, but the code at the bottom needs to be refactored so it is reusable when retrieving web property data. The main two issues I can't figure out is how to make the Google Analytics instance reusable and how to structure the OAuth redirects.  Retrieve web properties:GoogleAnalyticsControllerdef ga_session    client = OAuth2::Client.new(ENV['GA_CLIENT_ID'], ENV['GA_SECRET_KEY'], {        :authorize_url => 'https://accounts.google.com/o/oauth2/auth',        :token_url => 'https://accounts.google.com/o/oauth2/token'    })    redirect_to client.auth_code.authorize_url({         :scope => 'https://www.googleapis.com/auth/analytics.readonly',         :redirect_uri => ENV['GA_OAUTH_REDIRECT_URL'],         :access_type => 'offline'     })  end  def oauth_callback    session[:oauth_code] = params[:code]    redirect_to new_report_path  endReportsControllerdef new     @report = Report.new     ga_obj = GoogleAnalytics.new     ga_obj.initialize_ga_session(session[:oauth_code])     @ga_web_properties = ga_obj.fetch_web_propertiesendGoogleAnalytics modeldef initialize_ga_session(oauth_code)    client = OAuth2::Client.new(ENV['GA_CLIENT_ID'], ENV['GA_SECRET_KEY'], {        :authorize_url => 'https://accounts.google.com/o/oauth2/auth',        :token_url => 'https://accounts.google.com/o/oauth2/token'    })    access_token_obj = client.auth_code.get_token(oauth_code, :redirect_uri => ENV['GA_OAUTH_REDIRECT_URL'])    self.user = Legato::User.new(access_token_obj)  end  def fetch_web_properties    self.user.web_properties  endRetrieve web property data: when creating the reportReportsControllerdef create    @report = Report.new(params[:report])    @report.get_top_traffic_keywords(session[:oauth_code])    create!endReport Modeldef get_keywords(oauth_code)    ga = GoogleAnalytics.new    ga.initialize_ga_session(oauth_code) # this is a problem b/c the user will be redirected the new_report_path after the callack    self.url = ga.fetch_url(self.web_property_id)    self.keywords = # Get keywords for self.url from another service    keyword_revenue_data(oauth_code)enddef keyword_revenue_data(oauth_code)    ga = GoogleAnalytics.new    ga.initialize_ga_session(oauth_code)    revenue_data = # Get revenue dataend", "title": "Rails service + OAuth", "tags": "ruby;ruby on rails;oauth"}
{"id": "_webmaster.58597", "question": "I have read that Google Analytics supports click conversions (Tracking click conversions with Google Analytics).But I think I rather have conversions tracked within AdWords so I have a single source where I can monitor performance of specific campaigns.So, is there a way for me to setup click conversions within AdWords, I could not find it here https://support.google.com/adwords/answer/2375435 or here https://support.google.com/adwords/answer/1722054What I need specifically:be able to measure if a link with a specific class was clicked and of course assign that conversion to the campaign via which the user arrivedonly measure a conversion if a link was clicked by a user who camevia one of my AdWords campaigns (so a user who would navigate directly to my siteand clicked that link would not be tracked as a conversionUPDATEI do not have a landing page on which I can measure a conversion, since I'm an affiliate and don't sell the products myself, but redirect users to 3rd party publisher sites, I don't know whether a user actually buys the product. But I can get a pretty good indication of a conversion by measuring the click on a link that is directed to an external site. See how it works here: http://www.wonderweddings.com/weddingshopfrom this page and from any productdetail page the user can click to an external site. THAT is the click I want to set as a conversion.", "title": "Use Google Adwords to track click conversions", "tags": "google adwords;tracking;conversions"}
