{"id": "kp20k_training_0", "title": "virtually enhancing the perception of user actions", "abstract": "This paper proposes using virtual reality to enhance the perception of actions by distant users on a shared application. Here, distance may refer either to space ( e.g. in a remote synchronous collaboration) or time ( e.g. during playback of recorded actions). Our approach consists in immersing the application in a virtual inhabited 3D space and mimicking user actions by animating avatars. We illustrate this approach with two applications, the one for remote collaboration on a shared application and the other to playback recorded sequences of user actions. We suggest this could be a low cost enhancement for telepresence", "keywords": ["telepresence", "animation", "avatars", "application sharing", "collaborative virtual environments"]}
{"id": "kp20k_training_1", "title": "Dynamic range improvement of multistage multibit Sigma Delta modulator for low oversampling ratios", "abstract": "This paper presents an improved architecture of the multistage multibit sigma-delta modulators (EAMs) for wide-band applications. Our approach is based on two resonator topologies, high-Q cascade-of-resonator-with-feedforward (HQCRFF) and low-Q cascade-of-integrator-with-feedforward (LQCEFF). Because of in-band zeros introduced by internal loop filters, the proposed architecture enhances the suppression of the in-band quantization noise at a low OSR. The HQCRFF-based modulator with single-bit quantizer has two modes of operation, modulation and oscillation. When the HQCRFF-based modulator is operating in oscillation mode, the feedback path from the quantizer output to the input summing node is disabled and hence the modulator output is free of the quantization noise terms. Although operating in oscillation mode is not allowed for single-stage SigmaDeltaM, the oscillation of HQCRFF-based modulator can improve dynamic range (DR) of the multistage (MASH) SigmaDeltaM. The key to improving DR is to use HQCRFF-based modulator in the first stage and have the first stage oscillated. When the first stage oscillates, the coarse quantization noise vanishes and hence circuit nonidealities, such as finite op-amp gain and capacitor mismatching, do not cause leakage quantization noise problem. According to theoretical and numerical analysis, the proposed MASH architecture can inherently have wide DR without using additional calibration techniques", "keywords": ["sigma delta modulators", "analog-to-digital converters ", "multistage ", "multibit quantizer", "dynamic range improvement"]}
{"id": "kp20k_training_2", "title": "An ontology modelling perspective on business reporting", "abstract": "In this paper, we discuss the motivation and the fundamentals of an ontology representation of business reporting data and metadata structures as defined in the eXtensible business reporting language (XBRL) standard. The core motivation for an ontology representation is the enhanced potential for integrated analytic applications that build on quantitative reporting data combined with structured and unstructured data from additional sources. Applications of this kind will enable significant enhancements in regulatory compliance management, as they enable business analytics combined with inference engines for statistical, but also for logical inferences. In order to define a suitable ontology representation of business reporting language structures, an analysis of the logical principles of the reporting metadata taxonomies and further classification systems is presented. Based on this analysis, a representation of the generally accepted accounting principles taxonomies in XBRL by an ontology provided in the web ontology language (OWL) is proposed. An additional advantage of this representation is its compliance with the recent ontology definition metamodel (ODM) standard issued by OMG", "keywords": ["enterprise information integration and interoperability", "languages for conceptual modelling", "ontological approaches to content and knowledge management", "ontology-based software engineering for enterprise solutions", "domain engineering"]}
{"id": "kp20k_training_3", "title": "The self-organizing map", "abstract": "An overview of the self-organizing map algorithm, on which the papers in this issue are based, is presented in this article", "keywords": ["self-organizing map", "learning vector quantization"]}
{"id": "kp20k_training_4", "title": "The Amygdala and Development of the Social Brain", "abstract": "The amygdala comprises part of an extended network of neural circuits that are critically involved in the processing of socially salient stimuli. Such stimuli may be explicitly social, such as facial expressions, or they may be only tangentially social, such as abstract shapes moving with apparent intention relative to one another. The coordinated interplay between neural activity in the amygdala and other brain regions, especially the medial prefrontal cortex, the occipitofrontal cortex, the fusiform gyrus, and the superior temporal sulcus, allows us to develop social responses and to engage in social behaviors appropriate to our species. The harmonious functioning of this integrated social cognitive network may be disrupted by congenital or acquired lesions, by genetic anomalies, and by exceptional early experiences. Each form of disruption is associated with a slightly different outcome, dependent on the timing of the experience, the location of the lesion, or the nature of the genetic anomaly. Studies in both humans and primates concur; the dysregulation of basic emotions, especially the processing of fear and anger, is an almost invariable consequence of such disruption. These, in turn, have direct or indirect consequences for social behavior", "keywords": ["social brain", "amygdala", "behavior", "facial expression"]}
