{"id": "ny0282969", "categories": ["us", "politics"], "date": "2016/07/21", "title": "For Donald Trump’s Big Speech, an Added Pressure: No Echoes", "abstract": "CLEVELAND — Until Monday night, Donald J. Trump’s biggest concern about his convention speech was how much to reveal about himself and his family in an address that is often the most personal one a presidential candidate delivers. But the political firestorm over his wife’s speech , which borrowed passages from Michelle Obama’s convention remarks in 2008, raised the stakes exponentially. Mr. Trump’s speech on Thursday night cannot merely be his best ever. It also has to be bulletproof. By Tuesday morning, word had spread throughout his campaign that any language in Mr. Trump’s address even loosely inspired by speeches, essays, books or Twitter posts had to be either rewritten or attributed. Mr. Trump’s chief speechwriter, Stephen Miller, reassured colleagues that the acceptance speech was wholly original, according to two staff members who spoke with him and described those conversations on the condition of anonymity. Mr. Miller also told campaign aides that he had looked closely at passages that Mr. Trump had contributed — handwritten on unlined white pages — and was confident they contained no problems. (Mr. Miller declined an interview request.) Even so, one of the staff members downloaded plagiarism-detection software and ran a draft of the speech through the program. No red flags came up. The intense scrutiny of Mr. Trump’s words added new pressure to a speechwriting process that has been one of the most unpredictable and free-form in modern presidential campaigns. A month ago, Mr. Trump began giving dictation on themes for the speech, and he tossed ideas and phrases to Mr. Miller or other advisers on a daily basis. On printed copies of each draft, he circled passages he liked, crossed out or put question marks beside lines that he did not favor and frequently suggested new words or phrases. Image Stephen Miller, left, Mr. Trump’s chief speechwriter, and Paul Manafort, the campaign chairman, before an event for the candidate at the Trump SoHo hotel in New York last month. Credit Damon Winter/The New York Times “I’ve been amending the drafts big-league,” Mr. Trump said in an interview in his Manhattan office before the convention. “I get ideas from a lot of different places, a lot of smart people, but mostly I like language that sounds like me.” Yet in the aftermath of Melania Trump’s speech, campaign advisers have fretted that they do not know for sure where Mr. Trump gets his ideas and language — whether they are his own, in other words, or are picked up from Twitter, television, or, say, a best seller by Bill O’Reilly of Fox News, a commentator whom Mr. Trump likes. Borrowing or adapting may not always be tantamount to plagiarism, but several Trump advisers, who also insisted on anonymity, said that after the furor over Ms. Trump’s remarks, the campaign cannot allow a similar blowup. Ed Rollins, a Republican strategist who is advising a “super PAC” supporting Mr. Trump, said that the candidate could not afford any mistakes. “His speech is the whole game,” Mr. Rollins said. “Viewers have to watch it and say, ‘There is the next president of the United States.’” In the interview, Mr. Trump said his speech would center on his vision of a strong and secure America that “once existed and no longer does, but can again under a Trump administration.” Latest Election Polls 2016 Get the latest national and state polls on the presidential election between Hillary Clinton and Donald J. Trump. His greatest challenge, he said, was “putting myself in the speech” — discussing his upbringing and early experiences and relating them to the hopes and aspirations of other Americans. “I was never comfortable getting personal about my family because I thought it was special territory,” Mr. Trump said, glancing at a picture of his father on his desk. “It can feel exploitative to use family stories to win votes. And I had a very happy and comfortable life growing up. I had a great relationship with my father. But my focus needs to be on all the Americans who are struggling.” He said he was unsure if he would discuss his older brother Fred, who died as an alcoholic in 1981 at 43 — and whom he has described as an example of how destructive choices can damage lives that seem golden. “Without my brother Fred I might not be here,” Mr. Trump said. “He was really smart, great-looking. I don’t drink or smoke because of what happened to him. I focused on building my business and making good choices. I may talk about that, but I don’t know if I should.” Acceptance speeches seldom seem complete without anecdotes about personal trials and triumphs: Mitt Romney, trying to persuade voters to see him as more than a rich businessman, devoted about a fourth of his 2012 address to his parents’ unconditional love, his Mormon faith and reminiscences about watching the moon landing. In 2008 , Barack Obama described how his grandfather benefited from the G.I. Bill and how his mother and grandmother taught him the value of hard work. And Bill Clinton’s 1992 speech vividly recalled the life lessons he learned from his mother about fighting and working hard, from his grandfather about racial equality — and from his wife, Hillary, who, Mr. Clinton said, taught him that every child could learn. Mr. Clinton finished his speech with a now-famous line tying his Arkansas hometown to the American dream. “I end tonight where it all began for me,” he said. “I still believe in a place called Hope.” James Carville, a senior strategist for Mr. Clinton’s 1992 campaign, said that if Mr. Trump hoped to change the minds of those who see him as divisive or bigoted, he would need to open himself up to voters in meaningfully personal ways in his speech. “If he’s really different than the way he seems in television interviews or at his rallies, Thursday’s speech will be his single greatest opportunity to show voters who he really is,” Mr. Carville said. Paul Manafort, the Trump campaign chairman, said that Thursday’s speech would be “very much a reflection of Mr. Trump’s own words, as opposed to remarks that others create and the campaign puts in his mouth.” “He’s not an editor — he is actually the creator of the speech,” Mr. Manafort said. “Mr. Trump has given Steve Miller and I very specific directions about how he views the speech, what he wants to communicate, and ways to tie together things that he has been talking about in the campaign. The speech will end up being tone-perfect because the speech’s words will be his words.” Mr. Trump prefers speaking off the cuff with handwritten notes, a style that has proved successful at his rallies, where he has shown a talent for connecting with and electrifying crowds. But his adjustment to formal speeches remains a work in progress: He does not always sound like himself, and reading from a text can detract from the sense of authenticity that his supporters prize. One question is whether, or how much, he will ad-lib. He has sometimes seemed unable to resist deviating from prepared remarks, often to ill effect — ranting about a mosquito , or joking that a passing airplane was from Mexico and was “ getting ready to attack .” “Ad-libbing is instinct, all instinct,” Mr. Trump said. “I thought maybe about doing a freewheeling speech for the convention, but that really wouldn’t work. But even with a teleprompter, the speech will be me — my ideas, my beliefs, my words.”", "keyword": "2016 Presidential Election;Donald Trump;Republican National Convention,RNC;Speeches;Plagiarism;Melania Trump"}
{"id": "ny0225578", "categories": ["sports", "hockey"], "date": "2010/10/16", "title": "In Home Opener, Rangers Lose Gaborik and Drury to Injuries", "abstract": "There were silver linings to the Rangers ’ wild 4-3 overtime loss in their home opener at Madison Square Garden on Friday night. But the clouds they lined were huge, dark and ominous. Marian Gaborik left the game with a separated left shoulder in the second period after being boarded by Toronto’s Colby Armstrong. Gaborik, whose 42 goals led the Rangers last season, will be out of action for at least two weeks, Rangers Coach John Tortorella said after the game. Chris Drury also left with an injury in the second period after colliding with his teammate Michal Rozsival and falling into the boards. Drury, making his season debut after missing the first two games with a broken left index finger, broke the same finger in a different place. He will be out six weeks, Tortorella said. Vinny Prospal, the Rangers’ No. 2 scorer last season, will be operated on Tuesday to repair the right knee that has prevented him from playing so far this season. Tortorella said Prospal would be out indefinitely. The silver linings could be found in the Rangers’ ability to rally from a 3-1 second-period deficit, as well as a 30-12 shooting deficit, to tie the Leafs at the end of regulation and salvage a point in the standings. The star of the game for the Rangers was Brian Boyle, who scored both goals. Boyle, the fourth-line center, scored only four times in 71 games last season. But he was given extra shifts because of the injuries to Gaborik and Drury, and he made the most of the opportunity. “It’s great to get into the rhythm of a game,” Boyle said. “To get called on a few more times, that was a good feeling.” Henrik Lundqvist also deserved credit for the point, stopping 34 of 38 shots from the Leafs, who are now 4-0 — their best start since 1993-94. The Rangers are 1-1-1. “I’m happy about our resiliency, getting a point after not doing what we needed to do through the first two periods,” Tortorella said. “We’ll take the point.” Brandon Dubinsky tried to dwell on the positive, saying, “We found a way to come back from two goals and create something positive.” But the clouds cast a shadow over any positive developments. Particularly troubling was the second period, when the Rangers were overwhelmed and surrendered three unanswered goals. “They were screaming through the neutral zone,” Tortorella said of the Leafs. “We couldn’t catch them. I can’t believe they’re that quick.” Clarke MacArthur, Mike Komisarek and Phil Kessel scored for Toronto, all on plays that involved rushes down ice with Rangers chasing in futility. The Rangers also lost Gaborik and Drury in the second period. But their rally in the third tied the score thanks to Boyle and Sean Avery, who had about as mixed a game as any player can have. He had two assists, including the setup on the Boyle goal that tied the score, and went plus-3. Avery also took two needless penalties — one in which he dropped his gloves to fight Armstrong, who had not dropped his, and another in which he needlessly slashed Komisarek across the back of the legs during a stoppage in play. “Sean gave us some effective minutes,” Tortorella said. “But that’s where we’re going to have to continue working with him. He has to realize there are different ways to accomplish that.” Boyle’s goals, Lundqvist’s saves and the Rangers’ six penalty kills got them to overtime. But then the Rangers surrendered a seventh power play, after Marc Staal was penalized for interfering with Tim Brent. Kessel scored his second goal of the game on the ensuing advantage, 3 minutes 8 seconds into the overtime session. Tortorella said he was frustrated by Staal’s taking an unnecessary penalty. Now the Rangers — who have managed to avoid injury trouble the last two seasons — must figure out how to plug the holes opened by the loss of Gaborik and Drury. Erik Christensen, recovered from a groin pull, should be ready to take Drury’s place at center. Todd White may dress to take another vacant forward position, or the Rangers may try to call up Tim Kennedy, recently demoted to Hartford in the American Hockey League. But they could easily lose him to waivers, as he carries only a $275,000 cap hit for any claiming team. That is another big cloud hovering over the Rangers.", "keyword": "Hockey Ice;Toronto Maple Leafs;New York Rangers;Lundqvist Henrik"}
{"id": "ny0118528", "categories": ["business"], "date": "2012/10/14", "title": "The Role of Politics in Wealth Distribution", "abstract": "MITT ROMNEY has apologized for his depiction of 47 percent of America as wealth takers rather than wealth makers. But his blunder touched inadvertently on some discomforting truths about the importance of politics in income distribution in the United States. If Mr. Romney’s points were to be reformulated in a more defensible direction, the outline might look something like this: OF MAKING AND TAKING The correct distinction is not “makers versus takers.” The problem is that taking, rather than making wealth, appears to be growing in relative influence. Most of us are actually both makers and takers. Consider farmers who produce food and favor agricultural subsidies. The question is whether the role of wealth maker has more influence over our politics, at any given time, than does the taker role. Is public policy being adjudicated on grounds of ethics and efficiency, or is the real story about lobbying and the relative power of different interest groups? It isn’t easy to measure whether politics is less public-spirited these days, and we should resist the tendency to idealize the past. Still, job creation, median income and other measures of economic well-being have done poorly since the late 1990s. That suggests that America isn’t paying enough attention to creating wealth and increasing general prosperity. FOLLOW THE MONEY Seven of the 10 most affluent counties in the nation are near Washington, D.C. That means a growing number of educated people are making a very good living advising, lobbying and otherwise influencing the federal government. This is a talent drain. It’s far from obvious that we are getting better policy as a result, and true wealth creation has not kept pace. As Matthew Yglesias, a columnist for the online magazine Slate, has pointed out, there is also a subtler point about those wealthy Virginia and Maryland counties. They have high per capita incomes, not only because they attract educated, government-oriented professionals, but also because their zoning and building codes limit the supply of low-cost housing. That’s a significant government intervention that hurts lower-income people, who must pay more. Privilege-seeking through government is often most pernicious when it has a tidy front and a well-manicured green lawn. UNEQUAL INFLUENCE Politics based on lobbying stacks the deck against lower-income groups, who are often outmaneuvered. For instance, one of the biggest problems faced by the poor today is inadequate K-12 education. They need improved public schools, more school choice, or some mix of both. Over time, such improvements would help deal with many other social and economic issues, including global competitiveness, domestic unemployment, public health and the budget deficit, because quality education has many beneficial effects. Instead, the current system of transfers offers to the poor various sops in place of more effective reforms. Fundamental improvements to education would involve more challenging changes to residential zoning, teacher unions and certification systems, and might also take some educational finance and control out of the hands of local municipalities. It is no surprise that well-off families want to keep a system that has done very well by them, and that the poor often lose political battles over education. EVERYONE FEELS ENTITLED People tend to think that they have justice on their side, whether it comes to making or taking. For example, millions of homeowners have spent hundreds of thousands of dollars on the premise that the tax deduction for mortgages will be continued. If they support a continuation of that deduction they hardly feel like brigands, even though a bipartisan consensus of economists doubts the efficiency of this tax break. As years and decades pass, recipients of this deduction and other benefits start to see them as deeply and richly deserved. Furthermore, almost all of us reap one or more of these benefits, so few individuals are consistently opposed to all government transfers. It becomes difficult for a politician to articulate exactly what is wrong with this arrangement when the audience itself is in on the game and perhaps does not want to hear about its own takings. A HISTORICAL PERSPECTIVE The Founding Fathers were extremely worried about the threat to society posed by corruption and privilege-seeking. Drawing on examples going back to antiquity, they understood how unmitigated wealth-taking could create a negative and cumulatively self-reinforcing political dynamic. They also understood that the Constitution — or any constitution — would be an extremely imperfect remedy for this problem.  It is therefore correct to reject Mr. Romney’s depiction as off-base and misleading. Yet the fact that he didn’t present the truth is an indication that the problem is actually worse than many of us realize.", "keyword": "United States Economy;Romney Mitt;Income Inequality;Presidential Election of 2012;Lobbying and Lobbyists;High Net Worth Individuals;Poverty;Washington (DC)"}
{"id": "ny0229743", "categories": ["sports", "basketball"], "date": "2010/09/05", "title": "Timofey Mozgov of the Knicks Helps Russia at Worlds", "abstract": "ANKARA, Turkey — An international scout for the last 15 years, Kevin Wilson said that no matter how politically incorrect it is, he engages in profiling when analyzing European players. When scouting Russians, Wilson acknowledged, he casts a skeptical eye. Too often, he said, they have a poor work ethic and lack mental toughness. It is a stereotype that the Russian national team coach, David Blatt, said stemmed from a rule in the lucrative professional leagues there that requires teams to have two Russians on the floor at all times. But the back story of Timofey Mozgov, who signed with the Knicks in July , belies that of a typical player in the Russian system, which tends to usher top young players to pro teams and coddle them. Mozgov, 24, is an athletic 7-foot-1 late bloomer whose performance for Russia during pool play at the world championships has been one of the surprises of the tournament. Coming off the bench behind the former Kansas star Sasha Kaun, Mozgov scored 18 points in Russia’s victory over Greece on Thursday, has averaged 11.8 points over all and has helped lead a Russian team without any N.B.A. players to a 4-1 record. “I think it’s going to be easier for him in the N.B.A. than in Europe,” Blatt said. “He’s not going to have to be a lead player, and they’ll probably put him in a small area of the game where he has to pick and cut or run the break hard, which he does extremely well. “Still, it’s going to be a big adjustment for Timofey.” If Russia beats France and the United States beats Angola in knockout-round games Monday, the teams will play Thursday . The game would give N.B.A. players their first significant look at Mozgov. Last week in Ankara, he looked like a polished passer in Blatt’s hybrid Princeton offense and showed a soft touch on his jump shot. Tapping in putbacks against Ivory Coast is easier than boxing out his childhood idol, Kevin Garnett, but there are certain things that will not be lost in translation. “You can’t teach what he has — body, size and athletic ability,” said Tony Ronzone, the director of international player personnel for USA Basketball. “They’re hard to find in the world.” Mozgov said he was excited at the opportunity to come to the N.B.A. and described his only visit to New York as crazy. He said he planned on moving to New York with his girlfriend but did not know where he was going to live. Mozgov said he had been learning more English to help ease his adjustment, and at a recent interview he used an interpreter only about half the time. “I will have to prove myself, and I will try and show the coach that I can play,” he said. He added with a smile, “Because I want to play.” How much Mozgov plays will depend on his adjustment on and off the floor. Wilson said Mozgov was “kind of a maverick” by Russian basketball standards. He started playing late, never signed with a powerhouse Russian club and avoided signing with a Russian agent. Having to fight to be noticed helped him forge his work ethic. Mozgov spent most of his childhood near Krasnodar, a small agricultural city about 100 miles from the Black Sea. His family moved there from St. Petersburg, he said, because his father had health problems. The youngest of four brothers, Mozgov grew up in a working-class family. He said his father worked as a driver for a private company and his mother stayed at home to raise the family. “His family is definitely blue collar,” Wilson said. “He’s never had money, and he’s not money conscious the way a lot of poor kids are. That’s another thing that I like about him.” It is common in Europe for top youth players to sign with pro teams at young ages. But Mozgov said he did not start playing basketball seriously until age 15 when he went to a boarding school in St. Petersburg at the suggestion of a local coach. “I was playing only in my school, and it wasn’t a school that prepared me for basketball,” he said. That trip matured Mozgov’s game and also helped him handle his older brother, who he said roughed him around while growing up. “When I left and studied, and after my year I came back, my brothers couldn’t do anything,” he said with a smile. Mozgov never signed with a powerhouse Russian team like Dynamo Moscow or CSKA Moscow. He also did not play a lot for his club team, B.C. Khimki. Blatt said that Mozgov did not play much more than 15 minutes a game last year and compared him to a young pilot needing flight time. “His adjustment will be bigger than most, but his upside is great,” Blatt said. “I’m looking forward to Timofey making the jump. It’s not going to be easy for him. If he works hard and the New York people help him, he’s got a good chance to do something.” Part of Mozgov’s value to the Knicks is as an athletic big man who can alleviate some of the pounding that Amar’e Stoudemire, their prized free-agent signing , will take in the post. But to trade elbows with N.B.A. centers, Mozgov will need to continue to fill out his 269-pound frame. Because his most polished skill is his ability to use his athleticism to run the break, it is easy to see how he fits into Coach Mike D’Antoni’s up-tempo system. From his limited time working out Mozgov and seeing him on tape, D’Antoni said he was impressed with his ability to shoot the 15-footer, play pick-and-roll and run the floor. But he called Mozgov’s hands average and cautioned that success in individual workouts and Europe did not always translate to the N.B.A. “This kid, I’m excited about him; I want to see him play five on five,” D’Antoni said. “But what we saw of him working out, we’re excited. We think he can be really good.” He added, “He can be a good bookend with Amar’e. I do worry about his defense a little bit.” Mozgov signed a three-year deal with the Knicks worth about $9 million, but his impact may not be felt immediately. A classic late bloomer, Mozgov will need time to mature in New York. “He’s very raw, and he needs a lot of work,” said Wilson, the Knicks’ director of international scouting. “It’s unfair to him or anyone else to expect he’s a superstar out of the gate. “The best thing is if he could progress from a 5-minute guy to a 15-minute guy. If he can warrant being on the floor from 15 to 18 minutes, I think that would be a great first season for him.”", "keyword": "Basketball;Mozgov Timofey;New York Knicks"}
{"id": "ny0047160", "categories": ["nyregion"], "date": "2014/11/11", "title": "Craig Spencer, New York Doctor With Ebola, Will Leave Bellevue Hospital", "abstract": "Craig Spencer, the New York City doctor who became the first person in the city to test positive for Ebola, is free of the virus and is set to be released from Bellevue Hospital Center on Tuesday, hospital officials said on Monday. Dr. Spencer, 33, who had been in Guinea treating Ebola patients with Doctors Without Borders, was rushed to Bellevue by ambulance on Oct. 23 after reporting a fever of 100.3 to the authorities that morning. He was placed in isolation in a secure ward, and within hours a blood test confirmed he had the virus. His infection set the city on edge and set off a race to find his contacts over the previous few days, when he went bowling , dined out and rode on the subway and in an Uber taxi. But to date, no one else in the city has tested positive for the virus. Dr. Spencer is scheduled to appear at a news conference on Tuesday at the hospital. Ana Marengo, a spokeswoman for Bellevue, said in a statement that “after a rigorous course of treatment and testing,” Dr. Spencer posed “no public health risk.” It was unclear on Monday whether Dr. Spencer would return to his Hamilton Heights apartment, where his fiancée, Morgan Dixon , is under quarantine. Two friends who had contact with him in the days before his diagnosis were initially held in quarantine, but were recently released. Dr. Spencer was given a range of treatments, including an experimental drug and blood plasma donated by a recovered Ebola patient, Nancy Writebol , a 59-year-old missionary who contracted the virus in Liberia. His condition was serious at first, but by last week, he had recovered enough that he asked for, and was given, his banjo and an exercise bicycle to pass the time while he was in isolation. Dr. Spencer’s recovery adds to the evidence that when treated in advanced American hospitals, Ebola has a far lower fatality rate than in West African field hospitals starved of doctors, nurses and equipment. While 70 percent of Ebola patients in Africa are dying, eight of the nine patients treated in the United States have survived. The only one who died was Thomas Eric Duncan , a Liberian, whose treatment was delayed when a Dallas hospital initially misdiagnosed his illness. The experience of the Dallas hospital — two nurses who treated Mr. Duncan there contracted Ebola, but survived — caused American hospitals and public health officials to re-examine how they responded to possible cases. Requirements for protective gear were revamped, and when Dr. Spencer was taken to Bellevue, the federal Centers for Disease Control and Prevention dispatched a team to New York even before tests confirmed he had the virus. In Dallas, the C.D.C. did not arrive until two days after it was called. A day after Dr. Spencer went to Bellevue, Gov. Andrew M. Cuomo announced that all travelers arriving in New York who had had contact with Ebola patients in West Africa would be quarantined for 21 days, even if they had no symptoms and thus were not likely to be contagious. That policy, which New Jersey and several other states also enacted, was criticized by some public health experts as an overreaction that would discourage doctors and nurses from traveling to Africa to help contain the virus. Mr. Cuomo said he preferred to err on the side of caution.", "keyword": "Ebola;Craig Spencer;NYC;Bellevue Hospital Center"}
